Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/teachers_and_schools/teacher_qualifications_at_primary_and_post_primary_level.html.txt.tmx
Source language: en
Languages: ga

source: The Teacher Education Section of the Department of Education and Skills was established to oversee teacher education policy and practice
ga: Déanann an Rannóg Oideachas Múinteoirí sa Roinn Oideachais agus Scileanna maoirsiú ar bheartas agus chleachtas oideachais

source: The Department is involved in policy formulation, co-ordination, general direction and management, quality and financial control in supporting the provision of education and continuing support for teachers and schools
ga: Tá baint ag an Roinn i bhfoirmliú beartais, comhordú agus treoir agus bainistíocht ghinearálta, rialáil cáilíocht agus airgeadais chun tacú le soláthar oideachais agus le tacaíocht leanúnach a thabhairt do mhúinteoirí agus scoileanna

source: The Teaching Council is the professional standards body for teaching that promotes and regulates the profession
ga: Is í an Chomhairle Mhúinteoireachta an comhlacht caighdeán gairmiúil don mhúinteoireacht a rialaíonn agus chuireann an ghairm chun cinn

source: As the regulatory body for teachers in Ireland, the Teaching Council produces a code of professional conduct for teachers, which covers standards of teaching, knowledge, skill and competence
ga: Is comhlacht rialála í an Chomhairle Mhúinteoireachta le haghaidh múinteoirí in Éirinn agus cuireann sí cód iompair ghairmiúil ar fáil do mhúinteoirí. Baineann sé seo le caighdeáin múinteoireachta, eolas, scileanna agus inniúlacht

source: It also maintains a register of teachers
ga: Anuas air sin, coimeádann sí clár múinteoirí

source: Primary school teachers must be qualified to teach the range of primary school subjects to children aged 4 to 12 years
ga: Caithfidh múinteoirí bunscoile a bheith cáilithe chun raon ábhar bunscoile a mhúineadh do leanaí idir 4 agus 12 bliana d'aois

source: To qualify as a primary school teacher, you must have completed one of the following:
ga: Chun cáiliú mar mhúinteoir bunscoile, ní mór duit ceann den dá choinníoll seo leanas a bheith comhlánaithe agat:

source: • A recognised full-time degree programme, leading to the Bachelor of Education (B.Ed.) degree
ga: • Clár aitheanta lánaimseartha céime, a n-eascraíonn céim Bhaitsiléir Oideachais (B.Ed.) as

source: • A recognised Professional Masters in Education (Primary)
ga: • Dioplóma aitheanta Iarchéime san Oideachas (GDE)

source: A list of recognised colleges providing approved programmes is available on the website of the Teaching Council of Ireland
ga: Tá liosta ar shuíomh gréasain na Comhairle Teagaisc des na coláistí aitheanta a chuireann cláir fhaofa ar fáil

source: Irish language requirements: Primary school teachers must be able to teach the Irish language and the range of primary school subjects through Irish
ga: Riachtanais Gaeilge: Ní mór go mbíonn múinteoirí bunscoile in ann an Ghaeilge agus an réimse ábhair bhunscoile a mhúineadh trí Ghaeilge

source: Post primary teachers are normally required to teach at least 1 subject which they have studied to degree level
ga: De ghnáth tá iachall ar na múinteoirí iarbhunscoile 1 ábhar ar a laghad a mhúineadh a ndearna siad staidéar air go leibhéal na céime

source: Post-primary teachers do not need to have a qualification in the Irish language unless they are employed by a Gaeltacht school or a school where Irish is the medium of instruction
ga: Ní gá do mhúinteoirí iarbhunscoile cáilíocht a bheith acu sa Ghaeilge mura bhfuil siad fostaithe i scoil Ghaeltachta nó i scoil áit a bhfuil an Ghaeilge ina meán teagaisc

source: Qualification is usually achieved by gaining a primary degree from a recognised third-level institution
ga: Baintear cáilíocht amach de ghnáth trí bhunchéim a fháil ó institiúid aitheanta tríú leibhéal

source: This degree must include at least 1 subject from the post-primary schools’ curriculum for the Leaving Certificate Programme
ga: Ní mór 1 ábhar ar a laghad ó churaclam na n-iarbhunscoileanna le haghaidh Clár na hArdteistiméireachta a bheith san áireamh leis an gcéim seo

source: The Teaching Council is the professional standards body for teaching the promotes and regulates the profession. The primary degree is followed by a postgraduate qualification in education such as the Professional Masters in Education (PME)
ga: Leanann cáilíocht iarchéime san oideachas an bhunchéim, ar nós an Ard-Dioplóma san Oideachas (H.Dip.Ed) nó Dioplóma Gairmiúil san Oideachas (PDE)

source: The Teaching Council is the statutory body that sets the standards of academic achievement and professional training required of teachers
ga: Is í an Chomhairle Mhúinteoireachta an comhlacht reachtúil a leagann na caighdeáin de bhaint amach acadúil agus d’oiliúint ghairmiúil a theastaíonn ó mhúinteoirí

source: Teachers who qualified outside Ireland
ga: Múinteoirí a cáilíodh lasmuigh d'Éirinn

source: If you are a primary or post-primary school teacher who qualified outside Ireland and you wish to teach in a recognised school, you must apply for recognition of your qualifications prior to registration
ga: Más múinteoir bunscoile nó iarbhunscoile tú a cháiligh lasmuigh d'Éirinn agus má theastaíonn uait múineadh i scoil aitheanta, ní mór duit iarratas a chur isteach le haghaidh aitheantais ar do cháilíochtaí roimh chlárú

source: The Teaching Council is responsible for processing applications and regulating admissions to the teaching profession in Ireland
ga: Tá an Chomhairle Teagaisc freagrach as iarratais a phróiseáil agus as iontrálacha chuig gairm na múinteoireachta in Éirinn a rialú

source: Qualifications obtained outside the EU must be acceptable to the Council
ga: Caithfidh cáilíochtaí a fhaightear lasmuigh den AE a bheith inghlactha don Chomhairle

source: Once your qualifications have been recognised, you may then apply for registration
ga: Chomh luath is a aithnítear do chuid cáilíochtaí, is féidir leat iarratas a chur isteach ar chlárú

source: Foreign language assistants scheme
ga: Scéim na gcúntóirí teanga iasachta

source: This scheme allows for language assistants from France, Germany, Spain, Austria and Italy to be assigned to post-primary schools and colleges in Ireland
ga: Ligeann an scéim seo do chúntóirí teanga ón bhFrainc, ón nGearmáin, ón Spáinn, ón Ostair agus ón Iodáil a bheith sannta ar iarbhunscoileanna agus ar choláistí in Éirinn

source: Their fluency can help students understand and speak a foreign language and give them a better understanding of the way of life and customs of other countries
ga: Is féidir lena gcuid líofachta cúnamh a thabhairt do mhic léinn teanga iasachta a thuiscint agus a labhairt agus tuiscint níos fearr a thabhairt dóibh ar mhodh maireachtála agus ar chustaim i dtíortha eile

source: In the same way Irish students of French, German, Italian and Spanish can apply to work as English language assistants in the countries listed above
ga: Ar an dóigh chéanna is féidir le mic léinn Fraincise, Gearmáinise, Iodáilise agus Spáinnise as Éirinn iarratas a chur isteach mar chúntóirí Béarla sna tíortha a liostaítear thuas

source: Details of the English Language Assistant scheme can be found on the Department of Education and Skills website
ga: Is féidir teacht ar shonraí Scéim na gCúntóirí Béarla ar láithreán gréasáin na Roinne Oideachais agus Scileanna

source: There are a number of supports available to teachers for continuing professional development. The Department of Education and Skills, Teacher Education Section, provides support to school leaders and teachers in a number of areas such as curriculum reform, improving principals’ skills as leaders and managers, facilitating the management of schools and increasing the involvement of parents in the education of their children
ga: Tá líon tacaíochtaí ar fáil do mhúinteoirí le haghaidh forbartha gairmiúil leanúnach.Cuireann Rannóg Oideachais Mhúinteoirí na Roinne tacaíocht ar fáil do cheannairí scoile agus do mhúinteoirí i roinnt réimsí ar nós athchóiriú an churaclaim, scileanna na bpríomhoidí a fheabhsú mar cheannairí agus mar bhainisteoirí, bainistíocht scoileanna a éascú agus rannpháirtíocht tuismitheoirí in oideachas a gcuid leanaí a mhéadú

source: It also provides support to particular projects and initiatives including those related to priority areas of education provision such as disadvantage and inclusion, education for students with special educational needs, positive behaviour management and language support for foreign national students
ga: Cuireann sé tacaíocht ar fáil do thionscadail agus do thionscnaimh áirithe lena n-áirítear iad siúd a bhaineann le réimsí tosaíochta an tsoláthair oideachais ar nós míbhuntáiste agus cuimsiú, oideachas do mhic léinn a bhfuil riachtanais speisialta oideachais acu, bainistíocht dhearfach ar iompraíocht agus tacaíocht teanga do mhic léinn eachtrannacha

source: The nationwide network of education centres organise the local delivery of national programmes of teacher professional development on behalf of the Department of Education and Skills
ga: Eagraíonn an líonra d'ionaid oideachais ar fud na tíre seachadadh áitiúil ar chláir náisiúnta d'fhorbairt ghairmiúil múinteoirí thar ceann na Roinne Oideachais agus Scileanna

source: The centres also organise a varied local programme of activities for teachers, school management and parents in response to demand
ga: Eagraíonn na hionaid clár áitiúil éagsúlaithe de ghníomhaíochtaí do mhúinteoirí, do bhainistíocht scoile agus do thuismitheoirí mar fhreagra ar éileamh

source: Professional Development Service for Teachers
ga: Seirbhís Forbartha Gairmiúla do Mhúinteoirí

source: Professional Development Service for Teachers (PDST) provides professional development and support to help teachers and schools to provide the best possible education for all pupils and students
ga: Soláthraíonn an tSeirbhís um Fhorbairt Ghairmiúil do Mhúinteoirí (SFGM) forbairt agus tacaíocht ghairmiúil chun cabhrú le múinteoirí agus le scoileanna an t-oideachas is fearr is féidir a sholáthar do gach dalta agus mac léinn

source: Continuing Professional Development opportunities are provided for teachers on a nationwide basis and in collaboration with the Education Centre network
ga: Soláthraítear deiseanna um Fhorbairt Ghairmiúil Leanúnach do mhúinteoirí ar bonn náisiúnta agus i gcomhoibriú le líonra an Ionaid Oideachais

source: Training for special educational needs
ga: Oiliúint le haghaidh riachtanais speisialta oideachais

source: The Special Education Support Service co-ordinates, develops and delivers a range of professional development initiatives and support structures for school personnel working with students with special educational needs in a variety of educational settings
ga: Comhordaíonn, forbraíonn agus seachadann Seirbhís Tacaíochta don Oideachas Speisialta raon tionscnamh forbartha gairmiúla agus struchtúir tacaíochta do phearsanra scoile a oibríonn le mic léinn a bhfuil riachtanais speisialta oideachais acu in socruithe oideachais éagsúla

source: These include mainstream primary and post-primary schools, special schools and special classes attached to mainstream schools
ga: Ina measc seo tá bunscoileanna agus iarbhunscoileanna príomhshrutha, scoileanna speisialta agus ranganna speisialta atá ceangailte le scoileanna príomhshrutha

source: Since 28 January 2014, teachers employed in State-funded teaching positions in recognised schools must be registered with the Teaching Council in order to be paid from public funds
ga: Thosaigh Alt 30 den Acht um Chomhairle Mhúinteoireachta an 28 Eanáir 2014 a chiallaíonn go mbeidh ar gach múinteoir a oibreoidh i scoil aitheanta agus a shealbhóidh post múinteoireachta arna mhaoiniú ag an Stát a bheith cláraithe chun bheith íoctha as cistí an Stáit

source: Garda vetting and a character reference is required to register
ga: Teastaíonn Grinnfhiosrúchán an Gharda Síochána agus teistiméireacht charachtair chun clárú a dhéanamh

source: The Teaching Council provides details of registration for teachers
ga: Soláthraíonn an Chomhairle Mhúinteoireachta sonraí chun múinteoirí a chlárú
